Synergyst/toyOS_and_fun_libraries/Consolidated/main_mcu_esp32s3/MidiPlayer.h
#pragma once
/*
  MidiPlayer.h
  Single-header, no-interpreter MIDI (SMF) player for RP2040/RP2350 Arduino builds.
  - Parses Type-0/Type-1 SMF and creates a monophonic note list from one track
  - Plays via:
      1) Buzzer digital square (GPIO toggling)
      2) PWM square (analogWrite frequency set per-note, 50% duty)
      3) DAC or “PWMDAC” with simple waveforms (sine, 50% square, saw) using MCP4921 or a user hook
  - Minimal FS callback table to read files from your SimpleFS
  - Optional cancel and service hooks, console logging
  - No dependency on CoProcLang or scripting
  Notes:
  - For DAC modes, playback is streamed in real time with micros()-based scheduling
  - For PWM, analogWriteFreq() sets PWM frequency; 50% duty for square wave
  - For buzzer digital, uses delayMicroseconds toggling (best for piezos)
  - This is a simple monophonic player (track selection logic included)
  Dependencies:
    #include <Arduino.h>
    #include <SPI.h>       (if using MCP4921)
    #include "MCP_DAC.h"   (if using MCP4921 backend)
*/
#include <Arduino.h>
#include <math.h>
#include <stdarg.h>

#if defined(ARDUINO_ARCH_ESP32)
// Ensure LEDC API is available on ESP32 (both core v2 and v3)
#include <esp32-hal-ledc.h>
#include <esp_arduino_version.h>
#endif

#ifndef M_PI
#define M_PI 3.14159265358979323846
#endif
#ifndef tight_loop_contents
#define tight_loop_contents() \
  do { \
  } while (0)
#endif

class MCP4921;  // forward declaration (pointer only)

class MidiPlayer {
public:
  // Minimal FS ops you already can provide from ActiveFS
  struct FS {
    bool (*exists)(const char* name) = nullptr;
    bool (*getFileSize)(const char* name, uint32_t& size) = nullptr;
    uint32_t (*readFile)(const char* name, uint8_t* buf, uint32_t sz) = nullptr;
    uint32_t (*readFileRange)(const char* name, uint32_t off, uint8_t* buf, uint32_t len) = nullptr;
  };
  // Optional hooks
  typedef bool (*CancelHook)();              // return true to abort
  typedef void (*ServiceHook)();             // run background tasks during playback
  typedef void (*DacWrite12Hook)(uint16_t);  // for custom 12-bit DAC write if not using MCP4921
  enum class Backend {
    BuzzerDigital,  // GPIO toggle, square wave
    PWMSquare,      // analogWrite() square wave; 50% duty, frequency per note
    DAC,            // DAC synth with waveform
    PWMDAC          // alias of DAC (same pipeline; name kept for compatibility)
  };
  enum class Waveform {
    Sine,
    Square50,  // 50% duty cycle square
    Saw
  };
  enum class Debug : uint8_t {
    Off = 0,
    Errors = 1,
    Info = 2,
    Verbose = 3
  };
  struct Config {
    Backend backend = Backend::PWMSquare;
    // Buzzer or PWM output pin (ignored for DAC-only if using MCP on SPI)
    int outPin = 29;      // Default GP29 for PWM/buzzer
    int ledPin = 2;       // Optional LED pin; -1 to disable (keep GP2 by default)
    int trackIndex = -1;  // <0 => auto-select track with most NoteOn
    int gapMs = 0;        // gap (silence) between notes
    // PWM params
    uint16_t pwmRange = 255;  // analogWriteRange(255) default
    // DAC params
    Waveform waveform = Waveform::Sine;
    int dacAmpPercent = 60;  // 0..100 simple amplitude
    uint32_t sampleRate = 22050;
    // General
    bool allowSerialQ = true;  // 'q' stops playback on USB Serial
    // Debug
    Debug debug = Debug::Off;        // stage logs
    bool debugProgress = false;      // playback position printouts
    uint16_t debugIntervalMs = 250;  // progress print interval
  };

  // Public API
  MidiPlayer()
    : _fs{}, _console(&Serial), _cancel(nullptr), _service(nullptr),
      _allowSerialQ(true), _mcp(nullptr), _dacWriteHook(nullptr),
      _stopReason(StopReason::None) {}

  void attachFS(const FS& fs) {
    _fs = fs;
  }
  void setConsole(Print* p) {
    _console = p ? p : &Serial;
  }
  void setCancelHook(CancelHook h) {
    _cancel = h;
  }
  void setServiceHook(ServiceHook h) {
    _service = h;
  }
  void setMonitorSerialForQ(bool en) {
    _allowSerialQ = en;
  }
  // MCP4921 (DAC) backend
  void attachMCP4921(MCP4921* m) {
    _mcp = m;
    _dacWriteHook = nullptr;
  }
  // Custom 12-bit DAC backend
  void attachDacWriteHook(DacWrite12Hook fn) {
    _dacWriteHook = fn;
    _mcp = nullptr;
  }
  // PWM global defaults (call once if you plan to use PWM)
  void beginPWM(uint16_t range = 255) {
    mpwAnalogWriteRange(range);
  }

  // Main entry: play a MIDI file using provided work buffer
  // workBuf must hold the whole MIDI file plus note list (8 bytes per note entry).
  // If capacity is insufficient, returns false.
  bool playSMF(const char* path, const Config& cfg, uint8_t* workBuf, uint32_t workCap) {
    unsigned long t_start = micros();
    if (!checkFsReady() || !path || !*path || !workBuf || workCap == 0) {
      logln("midi: bad args or FS not ready");
      return false;
    }
    if (dbgOn(cfg, Debug::Info)) dbgf(cfg, "midi: begin '%s'\n", path);

    // 1) Load file into memory
    unsigned long t_load0 = micros();
    uint32_t midiSize = 0;
    if (!_fs.getFileSize(path, midiSize) || midiSize == 0 || midiSize > workCap) {
      logln("midi: getFileSize failed or buffer too small");
      return false;
    }
    if (_fs.readFile(path, workBuf, midiSize) != midiSize) {
      logln("midi: readFile failed");
      return false;
    }
    unsigned long t_load1 = micros();
    if (dbgOn(cfg, Debug::Info)) {
      dbgf(cfg, "midi: loaded %lu bytes in %lu us (cap %lu)\n",
           (unsigned long)midiSize, (unsigned long)(t_load1 - t_load0), (unsigned long)workCap);
    }

    // 2) Parse header, tempo map, and track selection
    const uint8_t* data = workBuf;
    uint32_t len = midiSize;
    uint16_t fmt = 0, ntrks = 0, division = 0;
    uint32_t off = 0;
    if (!parseHeaderSMF(data, len, fmt, ntrks, division, off)) {
      logln("midi: bad header");
      return false;
    }
    if ((division & 0x8000) != 0) {
      logln("midi: SMPTE time not supported");
      return false;
    }
    uint16_t tpq = division;
    if (tpq == 0) {
      logln("midi: zero TPQ");
      return false;
    }
    if (ntrks > MIDI_MAX_TRACKS) ntrks = MIDI_MAX_TRACKS;
    if (dbgOn(cfg, Debug::Info)) {
      dbgf(cfg, "midi: header: fmt=%u tracks=%u tpq=%u dataOff=%lu\n",
           (unsigned)fmt, (unsigned)ntrks, (unsigned)tpq, (unsigned long)off);
    }

    // Tempo map + per-track note-on counts
    unsigned long t_parse0 = micros();
    TempoEvent tempo[MIDI_MAX_TEMPO_EVENTS + 1];
    uint32_t tempoCount = 0;
    tempo[tempoCount].absTicks = 0;
    tempo[tempoCount].usPerBeat = 500000;  // default 120BPM
    tempoCount++;
    uint32_t trackNoteOnCounts[MIDI_MAX_TRACKS];
    for (uint16_t i = 0; i < ntrks; ++i) trackNoteOnCounts[i] = 0;
    uint32_t trkOff = off;
    for (uint16_t i = 0; i < ntrks; ++i) {
      uint32_t trkLen = 0;
      if (!findTrackAt(data, len, trkOff, trkLen)) {
        logln("midi: track not found");
        return false;
      }
      uint32_t noteOnCount = 0;
      uint32_t lastAbs = 0;
      buildTempoMapPass(&data[trkOff], trkLen, noteOnCount, tempo, tempoCount, MIDI_MAX_TEMPO_EVENTS, lastAbs);
      trackNoteOnCounts[i] = noteOnCount;
      trkOff += trkLen;
    }
    sortTempo(tempo, tempoCount);
    tempoCount = coalesceTempoSameTick(tempo, tempoCount);
    if (dbgOn(cfg, Debug::Info)) {
      dbgf(cfg, "midi: tempo events=%lu\n", (unsigned long)tempoCount);
      for (uint16_t i = 0; i < ntrks; ++i) {
        dbgf(cfg, "midi: track %u: noteOn=%lu\n", (unsigned)i, (unsigned long)trackNoteOnCounts[i]);
      }
    }
    int selIndex = cfg.trackIndex;
    if (selIndex < 0) {
      int best = -1;
      uint32_t bestC = 0;
      for (uint16_t i = 0; i < ntrks; ++i) {
        if (trackNoteOnCounts[i] > bestC) {
          bestC = trackNoteOnCounts[i];
          best = (int)i;
        }
      }
      selIndex = best;
    }
    if (selIndex < 0 || selIndex >= (int)ntrks) {
      logln("midi: no suitable track");
      return false;
    }
    if (dbgOn(cfg, Debug::Info)) dbgf(cfg, "midi: selected track=%d\n", selIndex);

    // 3) Two-pass parse for selected track -> count notes then extract to entries
    uint32_t noteCount = 0;
    if (!countSelectedTrackMonophonic(data, len, off, selIndex, tempo, tempoCount, tpq, noteCount)) {
      logln("midi: count pass failed");
      return false;
    }
    if (dbgOn(cfg, Debug::Info)) dbgf(cfg, "midi: monophonic count=%lu\n", (unsigned long)noteCount);
    if (noteCount == 0) {
      logln("midi: no notes");
      return true;
    }
    // Align entries start for safe 32-bit access on RP2040
    const uint32_t align = (uint32_t)alignof(CoplmNoteEntry);  // typically 4
    const uint32_t entriesOff = align_up_u32(midiSize, align);
    const uint32_t pad = entriesOff - midiSize;
    const uint32_t need = entriesOff + noteCount * sizeof(CoplmNoteEntry);
    if (dbgOn(cfg, Debug::Info)) {
      dbgf(cfg, "midi: buffer use: file=%lu entries=%lu*%u -> need=%lu cap=%lu\n",
           (unsigned long)midiSize, (unsigned long)noteCount, (unsigned)sizeof(CoplmNoteEntry),
           (unsigned long)need, (unsigned long)workCap);
      if (pad > 0) {
        dbgf(cfg, "midi: align pad=%lu (from %lu to %lu)\n",
             (unsigned long)pad, (unsigned long)midiSize, (unsigned long)entriesOff);
      }
    }
    if (need > workCap) {
      logf("midi: workBuf too small, need %lu bytes\n", (unsigned long)need);
      return false;
    }
    CoplmNoteEntry* entries = reinterpret_cast<CoplmNoteEntry*>(workBuf + entriesOff);
    uint32_t outN = 0;
    if (!extractSelectedTrackMonophonic(data, len, off, selIndex, tempo, tempoCount, tpq, entries, noteCount, outN)) {
      logln("midi: extract pass failed");
      return false;
    }
    unsigned long t_parse1 = micros();
    if (dbgOn(cfg, Debug::Info)) dbgf(cfg, "midi: extracted=%lu (parse %lu us)\n",
                                      (unsigned long)outN, (unsigned long)(t_parse1 - t_parse0));
    if (outN == 0) {
      logln("midi: no playable notes");
      return true;
    }

    // Estimate total playback time (us)
    uint64_t total_us = 0;
    for (uint32_t i = 0; i < outN; ++i) {
      total_us += entries[i].dur_us;
      if (cfg.gapMs > 0 && i + 1 < outN) total_us += (uint64_t)cfg.gapMs * 1000ULL;
    }
    if (dbgOn(cfg, Debug::Info)) {
      double secs = (double)total_us / 1000000.0;
      dbgf(cfg, "midi: estimated duration: %.2fs\n", secs);
    }

    // 4) Playback using chosen backend
    bool ok = false;
    switch (cfg.backend) {
      case Backend::BuzzerDigital:
        if (dbgOn(cfg, Debug::Info)) dbgf(cfg, "play: backend=buzzer notes=%lu\n", (unsigned long)outN);
        ok = playNotesBuzzer(entries, outN, cfg);
        break;
      case Backend::PWMSquare:
        if (dbgOn(cfg, Debug::Info)) dbgf(cfg, "play: backend=pwm notes=%lu\n", (unsigned long)outN);
        ok = playNotesPWMSquare(entries, outN, cfg);
        break;
      case Backend::DAC:
      case Backend::PWMDAC:
        if (dbgOn(cfg, Debug::Info)) dbgf(cfg, "play: backend=dac notes=%lu sr=%lu\n",
                                          (unsigned long)outN, (unsigned long)(cfg.sampleRate ? cfg.sampleRate : 22050));
        ok = playNotesDAC(entries, outN, cfg);
        break;
    }
    if (dbgOn(cfg, Debug::Info)) {
      unsigned long t_end = micros();
      dbgf(cfg, "midi: end status=%s (total %lu us)\n", ok ? "ok" : "fail", (unsigned long)(t_end - t_start));
    }
    return ok;
  }

