Synergyst/toyOS_and_fun_libraries/Consolidated/main_mcu_esp32s3/MidiPlayer.h
private:
  // =================== Internal types and helpers ===================
  struct CoplmNoteEntry {
    uint8_t note;
    uint8_t reserved0;
    uint16_t reserved1;
    uint32_t dur_us;  // microseconds
  };
  struct TempoEvent {
    uint32_t absTicks;
    uint32_t usPerBeat;
  };
  static constexpr uint32_t MIDI_MAX_TEMPO_EVENTS = 256;
  static constexpr uint32_t MIDI_MAX_TRACKS = 32;

  // Progress/debug helper
  struct Progress {
    bool enabled = false;
    uint32_t intervalMs = 250;
    uint64_t total_us = 0;
    unsigned long lastMs = 0;
  };
  void progressInit(Progress& pr, const CoplmNoteEntry* e, uint32_t n, const Config& cfg) {
    pr.enabled = cfg.debugProgress;
    if (!pr.enabled) return;
    pr.intervalMs = cfg.debugIntervalMs ? cfg.debugIntervalMs : 250;
    uint64_t total = 0;
    for (uint32_t i = 0; i < n; ++i) {
      total += (uint64_t)e[i].dur_us;
      if (cfg.gapMs > 0 && i + 1 < n) total += (uint64_t)cfg.gapMs * 1000ULL;
    }
    pr.total_us = total;
    pr.lastMs = millis();
    dbgf(cfg, "midi: play start: %lu notes, est %.2fs total\n",
         (unsigned long)n, (double)pr.total_us / 1000000.0);
  }
  void progressTick(Progress& pr, uint64_t elapsed_us, const Config& cfg) {
    if (!pr.enabled) return;
    unsigned long now = millis();
    if ((uint32_t)(now - pr.lastMs) >= pr.intervalMs) {
      double e = (double)elapsed_us / 1000000.0;
      double t = (double)pr.total_us / 1000000.0;
      double pct = (pr.total_us > 0) ? (100.0 * (double)elapsed_us / (double)pr.total_us) : 0.0;
      dbgf(cfg, "midi: %.2fs / %.2fs (%.0f%%)\n", e, t, pct);
      pr.lastMs = now;
    }
  }
  void progressDone(Progress& pr, const Config& cfg) {
    if (!pr.enabled) return;
    logln("midi: play end");
  }

  // Logging helpers
  inline bool dbgOn(const Config& cfg, Debug level) const {
    return (uint8_t)cfg.debug >= (uint8_t)level && _console;
  }
  void dbgf(const Config& cfg, const char* fmt, ...) {
    if (!_console || cfg.debug == Debug::Off) return;
    char buf[128];
    va_list ap;
    va_start(ap, fmt);
    vsnprintf(buf, sizeof(buf), fmt, ap);
    va_end(ap);
    _console->print(buf);
  }

  // Stop reason to make diagnostics clear
  enum class StopReason : uint8_t { None,
                                    SerialQ,
                                    CancelHook };
  void logStopIfAny(const Config& cfg) {
    if (!dbgOn(cfg, Debug::Info)) return;
    switch (_stopReason) {
      case StopReason::SerialQ: logln("play: stop by serial 'q'"); break;
      case StopReason::CancelHook: logln("play: stop by cancel hook"); break;
      default: break;
    }
    _stopReason = StopReason::None;
  }

  // LE VLQ
  static inline uint32_t vlq(const uint8_t*& p, const uint8_t* end, bool& ok) {
    ok = false;
    uint32_t v = 0;
    int cnt = 0;
    while (p < end) {
      uint8_t b = *p++;
      v = (v << 7) | (b & 0x7F);
      cnt++;
      if ((b & 0x80) == 0) {
        ok = true;
        return v;
      }
      if (cnt > 4) return 0;
    }
    return 0;
  }
  static bool parseHeaderSMF(const uint8_t* data, uint32_t len, uint16_t& fmt, uint16_t& ntrks, uint16_t& division, uint32_t& off) {
    off = 0;
    if (len < 14) return false;
    if (!(data[0] == 'M' && data[1] == 'T' && data[2] == 'h' && data[3] == 'd')) return false;
    uint32_t hdrLen = (data[4] << 24) | (data[5] << 16) | (data[6] << 8) | data[7];
    if (hdrLen < 6 || len < 8 + hdrLen) return false;
    fmt = (uint16_t)((data[8] << 8) | data[9]);
    ntrks = (uint16_t)((data[10] << 8) | data[11]);
    division = (uint16_t)((data[12] << 8) | data[13]);
    off = 8 + hdrLen;
    return true;
  }
  static bool findTrackAt(const uint8_t* data, uint32_t len, uint32_t& off, uint32_t& trackLen) {
    if (off + 8 > len) return false;
    if (!(data[off] == 'M' && data[off + 1] == 'T' && data[off + 2] == 'r' && data[off + 3] == 'k')) return false;
    trackLen = (uint32_t)(data[off + 4] << 24) | (uint32_t)(data[off + 5] << 16) | (uint32_t)(data[off + 6] << 8) | (uint32_t)(data[off + 7]);
    off += 8;
    if (off + trackLen > len) return false;
    return true;
  }
  static void buildTempoMapPass(const uint8_t* trk, uint32_t trkLen,
                                uint32_t& outNoteOnCount,
                                TempoEvent* tempo, uint32_t& tempoCount, uint32_t tempoMax,
                                uint32_t& lastAbs) {
    const uint8_t* p = trk;
    const uint8_t* end = trk + trkLen;
    uint8_t run = 0;
    uint32_t absTicks = 0;
    outNoteOnCount = 0;
    lastAbs = 0;
    while (p < end) {
      bool ok = false;
      uint32_t delta = vlq(p, end, ok);
      if (!ok) break;
      absTicks += delta;
      if (p >= end) break;
      uint8_t st = *p++;
      if (st < 0x80) {
        if (!run) break;
        p--;
        st = run;
      } else if (st < 0xF0) {
        run = st;
      }
      if ((st & 0xF0) == 0x90) {
        if (p + 1 > end) break;
        uint8_t note = *p++;
        uint8_t vel = *p++;
        (void)note;
        if (vel > 0) outNoteOnCount++;
      } else if ((st & 0xF0) == 0x80) {
        if (p + 1 > end) break;
        p += 2;
      } else if (st == 0xFF) {
        if (p >= end) break;
        uint8_t meta = *p++;
        (void)meta;
        bool ok2 = false;
        uint32_t ml = vlq(p, end, ok2);
        if (!ok2 || p + ml > end) break;
        if (meta == 0x51 && ml == 3) {
          uint32_t uspb = (uint32_t)p[0] << 16 | (uint32_t)p[1] << 8 | (uint32_t)p[2];
          if (tempoCount < tempoMax) {
            tempo[tempoCount].absTicks = absTicks;
            tempo[tempoCount].usPerBeat = uspb;
            tempoCount++;
          }
        }
        p += ml;
      } else {
        if (st == 0xF0 || st == 0xF7) {
          bool ok3 = false;
          uint32_t sl = vlq(p, end, ok3);
          if (!ok3 || p + sl > end) break;
          p += sl;
        } else {
          uint8_t hi = (st & 0xF0);
          int need = (hi == 0xC0 || hi == 0xD0) ? 1 : 2;
          if (p + need > end) break;
          p += need;
        }
      }
      lastAbs = absTicks;
    }
  }
  static inline void sortTempo(TempoEvent* t, uint32_t n) {
    for (uint32_t i = 1; i < n; ++i) {
      TempoEvent key = t[i];
      uint32_t j = i;
      while (j > 0 && t[j - 1].absTicks > key.absTicks) {
        t[j] = t[j - 1];
        --j;
      }
      t[j] = key;
    }
  }
  static inline uint32_t coalesceTempoSameTick(TempoEvent* t, uint32_t n) {
    if (n == 0) return 0;
    uint32_t w = 1;
    for (uint32_t i = 1; i < n; ++i) {
      if (t[i].absTicks == t[w - 1].absTicks) {
        t[w - 1] = t[i];
      } else {
        t[w++] = t[i];
      }
    }
    return w;
  }
  static inline uint32_t ticksToMicrosWithTempo(uint32_t ticks, const TempoEvent* tempo, uint32_t tempoCount, uint16_t tpq) {
    uint32_t us = 0, prevTick = 0, curUsPerBeat = 500000;
    for (uint32_t i = 0; i < tempoCount; ++i) {
      uint32_t tTick = tempo[i].absTicks;
      if (tTick > ticks) break;
      if (tTick > prevTick) {
        uint32_t dt = tTick - prevTick;
        us += (uint32_t)((uint64_t)dt * (uint64_t)curUsPerBeat / (uint64_t)tpq);
        prevTick = tTick;
      }
      curUsPerBeat = tempo[i].usPerBeat;
    }
    if (ticks > prevTick) {
      uint32_t dt = ticks - prevTick;
      us += (uint32_t)((uint64_t)dt * (uint64_t)curUsPerBeat / (uint64_t)tpq);
    }
    return us;
  }

