Synergyst/toyOS_and_fun_libraries/Consolidated/main_mcu_esp32s3/MidiPlayer.h
  // Count monophonic notes for selected track
  static bool countSelectedTrackMonophonic(const uint8_t* data, uint32_t len, uint32_t off,
                                           int selIndex,
                                           const TempoEvent* tempo, uint32_t tempoCount, uint16_t tpq,
                                           uint32_t& outNotesCount) {
    outNotesCount = 0;
    uint32_t scanOff = off;
    for (int i = 0; i < selIndex; ++i) {
      uint32_t tl = 0;
      if (!findTrackAt(data, len, scanOff, tl)) return false;
      scanOff += tl;
    }
    uint32_t trkLen = 0;
    if (!findTrackAt(data, len, scanOff, trkLen)) return false;
    const uint8_t* p = &data[scanOff];
    const uint8_t* end = p + trkLen;
    uint8_t run = 0;
    uint32_t absTicks = 0;
    int currentNote = -1;
    uint32_t currentStart = 0;
    bool currentActive = false;
    while (p < end) {
      bool ok = false;
      uint32_t delta = vlq(p, end, ok);
      if (!ok) break;
      absTicks += delta;
      if (p >= end) break;
      uint8_t st = *p++;
      if (st < 0x80) {
        if (!run) break;
        p--;
        st = run;
      } else if (st < 0xF0) {
        run = st;
      }
      if ((st & 0xF0) == 0x90) {
        if (p + 1 > end) break;
        uint8_t note = *p++;
        uint8_t vel = *p++;
        if (vel > 0) {
          if (currentActive) {
            uint32_t startUs = ticksToMicrosWithTempo(currentStart, tempo, tempoCount, tpq);
            uint32_t endUs = ticksToMicrosWithTempo(absTicks, tempo, tempoCount, tpq);
            if (endUs > startUs) outNotesCount++;
          }
          currentNote = note;
          currentStart = absTicks;
          currentActive = true;
        } else {
          if (currentActive && currentNote == note) {
            uint32_t startUs = ticksToMicrosWithTempo(currentStart, tempo, tempoCount, tpq);
            uint32_t endUs = ticksToMicrosWithTempo(absTicks, tempo, tempoCount, tpq);
            if (endUs > startUs) outNotesCount++;
            currentActive = false;
          }
        }
      } else if ((st & 0xF0) == 0x80) {
        if (p + 1 > end) break;
        uint8_t note = *p++;
        (void)*p++;
        if (currentActive && currentNote == (int)note) {
          uint32_t startUs = ticksToMicrosWithTempo(currentStart, tempo, tempoCount, tpq);
          uint32_t endUs = ticksToMicrosWithTempo(absTicks, tempo, tempoCount, tpq);
          if (endUs > startUs) outNotesCount++;
          currentActive = false;
        }
      } else if (st == 0xFF) {
        if (p >= end) break;
        uint8_t meta = *p++;
        (void)meta;
        bool ok2 = false;
        uint32_t ml = vlq(p, end, ok2);
        if (!ok2 || p + ml > end) break;
        p += ml;
      } else {
        if (st == 0xF0 || st == 0xF7) {
          bool ok3 = false;
          uint32_t sl = vlq(p, end, ok3);
          if (!ok3 || p + sl > end) break;
          p += sl;
        } else {
          uint8_t hi = (st & 0xF0);
          int need = (hi == 0xC0 || hi == 0xD0) ? 1 : 2;
          if (p + need > end) break;
          p += need;
        }
      }
    }
    if (currentActive) {
      uint32_t startUs = ticksToMicrosWithTempo(currentStart, tempo, tempoCount, tpq);
      uint32_t endUs = ticksToMicrosWithTempo(absTicks, tempo, tempoCount, tpq);
      if (endUs > startUs) outNotesCount++;
    }
    return true;
  }

  static bool extractSelectedTrackMonophonic(const uint8_t* data, uint32_t len, uint32_t off,
                                             int selIndex,
                                             const TempoEvent* tempo, uint32_t tempoCount, uint16_t tpq,
                                             CoplmNoteEntry* out, uint32_t cap, uint32_t& outCount) {
    outCount = 0;
    uint32_t scanOff = off;
    for (int i = 0; i < selIndex; ++i) {
      uint32_t tl = 0;
      if (!findTrackAt(data, len, scanOff, tl)) return false;
      scanOff += tl;
    }
    uint32_t trkLen = 0;
    if (!findTrackAt(data, len, scanOff, trkLen)) return false;
    const uint8_t* p = &data[scanOff];
    const uint8_t* end = p + trkLen;
    uint8_t run = 0;
    uint32_t absTicks = 0;
    int currentNote = -1;
    uint32_t currentStart = 0;
    bool currentActive = false;
    while (p < end) {
      bool ok = false;
      uint32_t delta = vlq(p, end, ok);
      if (!ok) break;
      absTicks += delta;
      if (p >= end) break;
      uint8_t st = *p++;
      if (st < 0x80) {
        if (!run) break;
        p--;
        st = run;
      } else if (st < 0xF0) {
        run = st;
      }
      if ((st & 0xF0) == 0x90) {
        if (p + 1 > end) break;
        uint8_t note = *p++;
        uint8_t vel = *p++;
        if (vel > 0) {
          if (currentActive && outCount < cap) {
            uint32_t startUs = ticksToMicrosWithTempo(currentStart, tempo, tempoCount, tpq);
            uint32_t endUs = ticksToMicrosWithTempo(absTicks, tempo, tempoCount, tpq);
            if (endUs > startUs) {
              out[outCount].note = (uint8_t)currentNote;
              out[outCount].reserved0 = 0;
              out[outCount].reserved1 = 0;
              out[outCount].dur_us = endUs - startUs;
              outCount++;
            }
          }
          currentNote = note;
          currentStart = absTicks;
          currentActive = true;
        } else {
          if (currentActive && currentNote == note && outCount < cap) {
            uint32_t startUs = ticksToMicrosWithTempo(currentStart, tempo, tempoCount, tpq);
            uint32_t endUs = ticksToMicrosWithTempo(absTicks, tempo, tempoCount, tpq);
            if (endUs > startUs) {
              out[outCount].note = (uint8_t)currentNote;
              out[outCount].reserved0 = 0;
              out[outCount].reserved1 = 0;
              out[outCount].dur_us = endUs - startUs;
              outCount++;
            }
            currentActive = false;
          }
        }
      } else if ((st & 0xF0) == 0x80) {
        if (p + 1 > end) break;
        uint8_t note = *p++;
        (void)*p++;
        if (currentActive && currentNote == (int)note && outCount < cap) {
          uint32_t startUs = ticksToMicrosWithTempo(currentStart, tempo, tempoCount, tpq);
          uint32_t endUs = ticksToMicrosWithTempo(absTicks, tempo, tempoCount, tpq);
          if (endUs > startUs) {
            out[outCount].note = (uint8_t)currentNote;
            out[outCount].reserved0 = 0;
            out[outCount].reserved1 = 0;
            out[outCount].dur_us = endUs - startUs;
            outCount++;
          }
          currentActive = false;
        }
      } else if (st == 0xFF) {
        if (p >= end) break;
        uint8_t meta = *p++;
        (void)meta;
        bool ok2 = false;
        uint32_t ml = vlq(p, end, ok2);
        if (!ok2 || p + ml > end) break;
        p += ml;
      } else {
        if (st == 0xF0 || st == 0xF7) {
          bool ok3 = false;
          uint32_t sl = vlq(p, end, ok3);
          if (!ok3 || p + sl > end) break;
          p += sl;
        } else {
          uint8_t hi = (st & 0xF0);
          int need = (hi == 0xC0 || hi == 0xD0) ? 1 : 2;
          if (p + need > end) break;
          p += need;
        }
      }
    }
    if (currentActive && outCount < cap) {
      // Close last hanging note at end-of-track time
      uint32_t endAbsTicks = 0;
      endAbsTicks = absTicks;
      uint32_t startUs = ticksToMicrosWithTempo(currentStart, tempo, tempoCount, tpq);
      uint32_t endUs = ticksToMicrosWithTempo(endAbsTicks, tempo, tempoCount, tpq);
      if (endUs > startUs) {
        out[outCount].note = (uint8_t)currentNote;
        out[outCount].reserved0 = 0;
        out[outCount].reserved1 = 0;
        out[outCount].dur_us = endUs - startUs;
        outCount++;
      }
    }
    return true;
  }

  static inline double midiNoteToFreq(int note) {
    double x = (double)(note - 69) / 12.0;
    return 440.0 * pow(2.0, x);
  }

  // =================== Playback backends ===================
  bool playNotesBuzzer(const CoplmNoteEntry* e, uint32_t n, const Config& cfg) {
    if (cfg.outPin < 0) {
      logln("buzzer: no pin");
      return false;
    }
    pinMode((uint8_t)cfg.outPin, OUTPUT);
    if (cfg.ledPin >= 0) pinMode((uint8_t)cfg.ledPin, OUTPUT);
    Progress pr;
    progressInit(pr, e, n, cfg);
    uint64_t songElapsed = 0;
    for (uint32_t i = 0; i < n; ++i) {
      if (shouldStop()) {
        logStopIfAny(cfg);
        progressDone(pr, cfg);
        return true;
      }
      double f = midiNoteToFreq((int)e[i].note);
      if (f < 1.0) f = 1.0;
      uint32_t half = (uint32_t)((1000000.0 / (2.0 * f)) + 0.5);
      if (half == 0) half = 1;
      uint64_t total = e[i].dur_us;
      uint64_t cycles = total / (2ULL * half);
      if (cycles == 0) cycles = 1;
      if (dbgOn(cfg, Debug::Verbose)) {
        dbgf(cfg, "note %lu: n=%u f=%.2fHz dur=%.1fms (buzzer)\n",
             (unsigned long)i, (unsigned)e[i].note, f, (double)total / 1000.0);
      }
      if (cfg.ledPin >= 0) digitalWrite((uint8_t)cfg.ledPin, HIGH);
      for (uint64_t c = 0; c < cycles; ++c) {
        if (shouldStop()) break;
        digitalWrite((uint8_t)cfg.outPin, HIGH);
        delayMicroseconds((uint32_t)half);
        digitalWrite((uint8_t)cfg.outPin, LOW);
        delayMicroseconds((uint32_t)half);
        uint64_t noteElapsed = (c + 1) * (2ULL * half);
        if (noteElapsed > total) noteElapsed = total;
        progressTick(pr, songElapsed + noteElapsed, cfg);
        serviceOnce();
      }
      if (cfg.ledPin >= 0) digitalWrite((uint8_t)cfg.ledPin, LOW);
      songElapsed += e[i].dur_us;
      if (cfg.gapMs > 0) {
        delay((uint32_t)cfg.gapMs);
        songElapsed += (uint64_t)cfg.gapMs * 1000ULL;
        progressTick(pr, songElapsed, cfg);
      }
      serviceOnce();
    }
    progressDone(pr, cfg);
    return true;
  }

