Synergyst/toyOS_and_fun_libraries/Consolidated/main_mcu_esp32s3/MidiPlayer.h
  bool playNotesPWMSquare(const CoplmNoteEntry* e, uint32_t n, const Config& cfg) {
    if (cfg.outPin < 0) {
      logln("pwm: no pin");
      return false;
    }
    pinMode((uint8_t)cfg.outPin, OUTPUT);
    if (cfg.ledPin >= 0) pinMode((uint8_t)cfg.ledPin, OUTPUT);
    mpwAnalogWriteRange(cfg.pwmRange ? cfg.pwmRange : 255);
    Progress pr;
    progressInit(pr, e, n, cfg);
    uint64_t songElapsed = 0;
    for (uint32_t i = 0; i < n; ++i) {
      if (shouldStop()) {
        logStopIfAny(cfg);
        progressDone(pr, cfg);
        return true;
      }
      double f = midiNoteToFreq((int)e[i].note);
      if (f < 1.0) f = 1.0;
      uint32_t freq = (uint32_t)(f + 0.5);
      if (freq < 1) freq = 1;
      if (dbgOn(cfg, Debug::Verbose)) {
        dbgf(cfg, "note %lu: n=%u f=%.2fHz dur=%.1fms (pwm)\n",
             (unsigned long)i, (unsigned)e[i].note, f, (double)e[i].dur_us / 1000.0);
      }
      mpwAnalogWriteFreq(freq);
      mpwAnalogWrite((uint8_t)cfg.outPin, (uint16_t)(cfg.pwmRange / 2));
      if (cfg.ledPin >= 0) digitalWrite((uint8_t)cfg.ledPin, HIGH);
      uint32_t t0 = micros();
      while ((uint32_t)(micros() - t0) < e[i].dur_us) {
        if (shouldStop()) break;
        uint32_t noteElapsed = (uint32_t)(micros() - t0);
        if (noteElapsed > e[i].dur_us) noteElapsed = e[i].dur_us;
        progressTick(pr, songElapsed + (uint64_t)noteElapsed, cfg);
        serviceOnce();
      }
      mpwAnalogWrite((uint8_t)cfg.outPin, 0);
      if (cfg.ledPin >= 0) digitalWrite((uint8_t)cfg.ledPin, LOW);
      songElapsed += e[i].dur_us;
      if (cfg.gapMs > 0) {
        delay((uint32_t)cfg.gapMs);
        songElapsed += (uint64_t)cfg.gapMs * 1000ULL;
        progressTick(pr, songElapsed, cfg);
      }
      serviceOnce();
    }
    progressDone(pr, cfg);
    return true;
  }

  bool playNotesDAC(const CoplmNoteEntry* e, uint32_t n, const Config& cfg) {
    if (!_mcp && !_dacWriteHook) {
      logln("dac: no DAC attached");
      return false;
    }
    if (cfg.ledPin >= 0) pinMode((uint8_t)cfg.ledPin, OUTPUT);
    // Synth stream params
    const uint32_t sr = cfg.sampleRate ? cfg.sampleRate : 22050;
    const int ampPct = clampi(cfg.dacAmpPercent, 0, 100);
    const int mid = 2048;
    const int amp = (int)((2047LL * ampPct) / 100);
    Progress pr;
    progressInit(pr, e, n, cfg);
    uint64_t songElapsed = 0;
    for (uint32_t i = 0; i < n; ++i) {
      if (shouldStop()) {
        dacSafeOff();
        if (cfg.ledPin >= 0) digitalWrite((uint8_t)cfg.ledPin, LOW);
        logStopIfAny(cfg);
        progressDone(pr, cfg);
        return true;
      }
      double f = midiNoteToFreq((int)e[i].note);
      if (f < 1.0) f = 1.0;
      if (dbgOn(cfg, Debug::Verbose)) {
        dbgf(cfg, "note %lu: n=%u f=%.2fHz dur=%.1fms (dac)\n",
             (unsigned long)i, (unsigned)e[i].note, f, (double)e[i].dur_us / 1000.0);
      }
      // Phase increment per sample
      double phase = 0.0;
      double incr = f / (double)sr;  // for [0,1) phase
      if (incr <= 0) incr = 1.0 / (double)sr;
      // Micros scheduler q/r (like your WAV code)
      const uint32_t q = 1000000u / sr;
      const uint32_t r = 1000000u % sr;
      uint32_t acc = 0;
      uint32_t elapsed = 0;
      uint32_t nextT = micros();
      if (cfg.ledPin >= 0) digitalWrite((uint8_t)cfg.ledPin, HIGH);
      while (elapsed < e[i].dur_us) {
        if (shouldStop()) {
          dacSafeOff();
          if (cfg.ledPin >= 0) digitalWrite((uint8_t)cfg.ledPin, LOW);
          logStopIfAny(cfg);
          progressDone(pr, cfg);
          return true;
        }
        // Generate sample in -1..+1
        double v = 0.0;
        switch (cfg.waveform) {
          case Waveform::Sine:
            {
              double ang = (phase * 2.0 * M_PI);
              v = sin(ang);
              break;
            }
          case Waveform::Square50:
            v = (phase < 0.5) ? 1.0 : -1.0;
            break;
          case Waveform::Saw:
            v = (2.0 * phase) - 1.0;
            break;
        }
        int samp = mid + (int)((double)amp * v);
        if (samp < 0) samp = 0;
        if (samp > 4095) samp = 4095;
        dacWrite12((uint16_t)samp);
        // Wait next sample time
        waitUntil(nextT);
        nextT += q;
        acc += r;
        if (acc >= sr) {
          nextT += 1;
          acc -= sr;
        }
        // Advance phase
        phase += incr;
        if (phase >= 1.0) phase -= 1.0;
        // Track elapsed micros
        elapsed += q;
        if (acc >= sr) elapsed += 1;  // matches the +1 above (small drift guard)
        if (_service) _service();
        // Progress update
        uint32_t noteElapsed = elapsed;
        if (noteElapsed > e[i].dur_us) noteElapsed = e[i].dur_us;
        progressTick(pr, songElapsed + (uint64_t)noteElapsed, cfg);
      }
      // End of this note: ensure DAC is off (0-level) and LED off between notes
      dacSafeOff();
      if (cfg.ledPin >= 0) digitalWrite((uint8_t)cfg.ledPin, LOW);
      if (cfg.gapMs > 0) {
        delay((uint32_t)cfg.gapMs);
        songElapsed += (uint64_t)cfg.gapMs * 1000ULL;
        progressTick(pr, songElapsed, cfg);
      }
      songElapsed += e[i].dur_us;
      serviceOnce();
    }
    // Completed all notes: ensure the DAC is off
    dacSafeOff();
    if (cfg.ledPin >= 0) digitalWrite((uint8_t)cfg.ledPin, LOW);
    progressDone(pr, cfg);
    return true;
  }

  // =================== Utilities ===================
  bool shouldStop() {
    if (_allowSerialQ && Serial.available()) {
      int c = Serial.peek();
      if (c == 'q' || c == 'Q') {
        (void)Serial.read();
        _stopReason = StopReason::SerialQ;
        return true;
      }
    }
    if (_cancel && _cancel()) {
      _stopReason = StopReason::CancelHook;
      return true;
    }
    return false;
  }
  void serviceOnce() {
    if (_service) _service();
    tight_loop_contents();
    yield();
  }
  void waitUntil(uint32_t target) {
    for (;;) {
      int32_t d = (int32_t)(micros() - target);
      if (d >= 0) break;
      tight_loop_contents();
      yield();
    }
  }
  void dacWrite12(uint16_t v) {
    if (_mcp) _mcp->fastWriteA(v);
    else if (_dacWriteHook) _dacWriteHook(v);
  }
  // Safe DAC off helper (call when stopping or finishing playback)
  void dacSafeOff() {
    if (_mcp) {
      _mcp->fastWriteA(0);
    } else if (_dacWriteHook) {
      _dacWriteHook(0);
    }
  }
  bool checkFsReady() const {
    return _fs.getFileSize && _fs.readFile;
  }
  static inline int clampi(int v, int lo, int hi) {
    if (v < lo) return lo;
    if (v > hi) return hi;
    return v;
  }
  // Align helper for entries region (avoid unaligned 32-bit access on RP2040)
  static inline uint32_t align_up_u32(uint32_t v, uint32_t a) {
    return (v + (a - 1)) & ~(a - 1);
  }
  void log(const char* s) {
    if (_console) _console->print(s);
  }
  void logln(const char* s) {
    if (_console) _console->println(s);
  }
  void logf(const char* fmt, ...) {
    if (!_console) return;
    char buf[128];
    va_list ap;
    va_start(ap, fmt);
    vsnprintf(buf, sizeof(buf), fmt, ap);
    va_end(ap);
    _console->print(buf);
  }

  // ------------- Cross-arch PWM wrappers (RP2040/ESP32) -------------
  static void mpwAnalogWriteRange(uint16_t range) {
#if defined(ARDUINO_ARCH_RP2040)
    analogWriteRange(range);
    (void)range;
#elif defined(ARDUINO_ARCH_ESP32)
    if (range == 0) range = 1;
    s_pwmRange = range;
    s_pwmResBits = bitsForRange(range);
    reconfigureAllChannels();
#else
    (void)range;
#endif
  }
  static void mpwAnalogWriteFreq(uint32_t hz) {
#if defined(ARDUINO_ARCH_RP2040)
    analogWriteFreq(hz);
#elif defined(ARDUINO_ARCH_ESP32)
    if (hz == 0) hz = 1;
    s_pwmFreq = hz;
    reconfigureAllChannels();
#else
    (void)hz;
#endif
  }
  static void mpwAnalogWrite(uint8_t pin, uint16_t duty) {
#if defined(ARDUINO_ARCH_RP2040)
    analogWrite(pin, duty);
#elif defined(ARDUINO_ARCH_ESP32)
    ensureChannel(pin);
    uint32_t maxv = (1u << s_pwmResBits) - 1u;
    if (s_pwmRange == 0) s_pwmRange = 255;
    uint32_t d = duty;
    if (d > s_pwmRange) d = s_pwmRange;
    uint32_t scaled = (uint32_t)(d * maxv) / (uint32_t)s_pwmRange;
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
    ledcWrite(pin, (uint32_t)scaled);
#else
    if (pin < s_channelForPinSize && s_channelForPin[pin] >= 0) {
      ledcWrite((uint8_t)s_channelForPin[pin], (uint32_t)scaled);
    }
#endif
#else
    analogWrite(pin, duty);
#endif
  }

#if defined(ARDUINO_ARCH_ESP32)
  // Common helpers for ESP32 cores
  static inline uint8_t bitsForRange(uint32_t range) {
    // Smallest bits such that (2^bits - 1) >= range
    uint8_t b = 1;
    uint32_t v = 1;
    while ((v - 1u) < range && b < 20) {
      b++;
      v <<= 1;
    }
    if (b < 1) b = 1;
    if (b > 20) b = 20;
    return b;
  }

  static void reconfigureAllChannels() {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
    // Core v3: pins are attached individually; reattach with new freq/res
    for (uint8_t pin = 0; pin < s_channelForPinSize; ++pin) {
      if (s_attachedPin[pin]) {
        ledcDetach(pin);
        (void)ledcAttach(pin, s_pwmFreq, s_pwmResBits);
      }
    }
#else
    // Core v2: re-setup existing channels
    for (int ch = 0; ch < MAX_LEDC_CHANNELS; ++ch) {
      if (s_pinForChannel[ch] >= 0) {
        ledcSetup((uint8_t)ch, (double)s_pwmFreq, (uint8_t)s_pwmResBits);
      }
    }
#endif
  }

  static void ensureChannel(uint8_t pin) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
    if (pin >= s_channelForPinSize) return;
    if (!s_attachedPin[pin]) {
      (void)ledcAttach(pin, s_pwmFreq, s_pwmResBits);
      s_attachedPin[pin] = true;
    }
#else
    if (pin >= s_channelForPinSize) return;
    if (s_channelForPin[pin] >= 0) return;
    int8_t ch = allocateChannel();
    if (ch < 0) return;  // out of channels
    s_channelForPin[pin] = ch;
    s_pinForChannel[ch] = (int8_t)pin;
    ledcSetup((uint8_t)ch, (double)s_pwmFreq, (uint8_t)s_pwmResBits);
    ledcAttachPin(pin, (uint8_t)ch);
#endif
  }

// Storage and APIs differ between core v2 and v3
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
  static constexpr uint8_t s_channelForPinSize = 64;  // enough for common pin numbers
  static bool s_attachedPin[s_channelForPinSize];
#else
  static constexpr int MAX_LEDC_CHANNELS = 16;
  static constexpr uint8_t s_channelForPinSize = 64;
  static int8_t s_channelForPin[s_channelForPinSize];
  static int8_t s_pinForChannel[MAX_LEDC_CHANNELS];
  static int8_t allocateChannel() {
    for (int ch = 0; ch < MAX_LEDC_CHANNELS; ++ch)
      if (s_pinForChannel[ch] < 0) return ch;
    return -1;
  }
#endif

