Synergyst/toyOS_and_fun_libraries/Consolidated/main_mcu_esp32s3/MidiPlayer.h
  // Common config across both v2 and v3
  static uint16_t s_pwmRange;
  static uint8_t s_pwmResBits;
  static uint32_t s_pwmFreq;
#endif  // ARDUINO_ARCH_ESP32

private:
  FS _fs;
  Print* _console;
  CancelHook _cancel;
  ServiceHook _service;
  bool _allowSerialQ;
  MCP4921* _mcp;                 // optional
  DacWrite12Hook _dacWriteHook;  // optional
  StopReason _stopReason;
};

// ===== Static storage for ESP32 =====
#if defined(ARDUINO_ARCH_ESP32)
uint16_t MidiPlayer::s_pwmRange = 255;
uint8_t MidiPlayer::s_pwmResBits = 8;
uint32_t MidiPlayer::s_pwmFreq = 1000;  // default; will be adjusted per-note

#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
bool MidiPlayer::s_attachedPin[MidiPlayer::s_channelForPinSize] = { false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false,
                                                                    false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false,
                                                                    false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false,
                                                                    false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false };
#else
int8_t MidiPlayer::s_channelForPin[MidiPlayer::s_channelForPinSize] = { -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
                                                                        -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
                                                                        -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
                                                                        -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1 };
int8_t MidiPlayer::s_pinForChannel[MidiPlayer::MAX_LEDC_CHANNELS] = { -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1 };
#endif
#endif